# UnableToPasteToFile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CuttingFailures..::..UnableToPasteToFile Property
BuiltInFailures..::..CuttingFailures Class See Also
---
Unable to paste current clipboard contents to file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToPasteToFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToPasteToFile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToPasteToFile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CuttingFailures Class
Autodesk.Revit.DB Namespace